[
  {
    "user": "Mayank",
    "letter": "Dear Mati, \n\nI’m sitting here, feeling like the biggest fool in the world. I know I’ve hurt you, and I’m so sorry. I didn’t mean for things to turn out this way, and I regret so much of what I did and said. \n\nYou’ve always been so kind, so caring, and I took that for granted. I was selfish, only thinking about myself, and I didn’t consider your feelings like I should have. I see now how much pain I caused you, and it breaks my heart to know that I was the reason for your sadness.\n\nI’ve made so many mistakes, and I wish I could go back in time and fix them. I would do anything to change the way things happened, to take back the hurtful words and actions. But I know I can’t do that, and it’s something I have to live with.\n\nAll I can do now is apologize from the bottom of my heart. I’m so sorry for making you feel unimportant, for not being there when you needed me, and for causing you pain. You didn’t deserve any of that, and I am so sorry that I let you down.\n\nI’m not perfect, but I’m trying to learn from my mistakes. I want to be a better person, someone who deserves to have you in their life. I know I have a long way to go, but I’m willing to do whatever it takes to show you that I can change.\n\nIf you can find it in your heart to forgive me, I would be so grateful. But if you can’t, I understand that too. I just needed to tell you how sorry I am, and how much I wish things could be different.\n\nYou will always be special to me, no matter what happens. I will never forget the kindness and love you showed me, and I will always regret the way I treated you.\n\nThank you for everything, and I’m so sorry for the pain I caused. I hope one day you can forgive me.\n\nWith all my heart,\n\nMayank ",
    "stamp": "stamp2",
    "date": "2024-08-11T17:31:49.359Z"
  },
  {
    "user": "Mati",
    "letter": "Hi Mayank,\n\nSorry I haven't replied for a long time but I didn't have internet access (WiFi). Now I have a moment, so I'm writing back.\n\nOkay, so what's your favorite episode so far? I really like the one with the wedding, but also the one with the oceanarium.\n \nYes, polar bears are definitely amazing. Other polar animals are interesting too, like foxes, because they change their huge fur for the winter. They are black in the summer and white in the winter.\n\nIf you say so, it shows me that this book is short. My book will definitely not be that long, so I don't have to break any records haha.\n\nNormally, you copy some of my texts haha.\n\nAt the end of most verbs in their basic form there is the letter \"ć\". This will allow you to recognize whether you are learning the basic or general form. The basic form of the word \"read\" is: \"czytać\". The personal forms are: \nJa czytam, \nty czytasz, \non/ona/ono czyta, \nmy czytamy, \nwy czytacie, \noni czytają.\n\nHave a good day (or night),\n~~Mati ",
    "stamp": "stamp3",
    "date": "2024-08-11T19:23:39.307Z"
  },
  {
    "user": "Mayank",
    "letter": "Hi Mati,\n\nHow are you? I hope you are doing well. I am really really sorry for deleting the Slowly profile of yours. I am crying because I deleted that and I also deserve this.\n\nI don't think I have a favourite episode so far. Can you have all the episodes as favorite? We'll, the wedding scene is great no doubt. But I think our wedding scene was more great. Don't you think so? It's been 5 months but it feels like 5 years haha.\n\nYou know what's more amazing than Polar bears, it's you. You are really really amazing. You are the best person I have ever met of course there are some exceptions like my sister and some family members.\n\nI am waiting for your book more than you are doing. Sometimes I say unnecessarily and I am sorry for that. But I regret all the things that I said later. By the way did you cried very much at the prom when you was eating grapes? \n\nAnd what texts did I copied of yours? And I will write some facts and jokes in my text letter. \n\nThank you for the tips, it will help me learn Polish faster. But first I think I need to rewrite the files that I have burnt. I think no one is more dumber than me.\n\nHave a good night. Take care of yourself, see you soon.\n\nByee,\nFounder of Pookie Letters ",
    "stamp": "stamp1",
    "date": "2024-08-11T19:43:33.416Z"
  },
  {
    "user": "",
    "letter": "hgss",
    "stamp": "stamp6",
    "date": "2024-08-12T16:52:53.691Z"
  },
  {
    "user": "Mayank",
    "letter": "Hello",
    "stamp": "stamp5",
    "date": "2024-08-13T16:21:14.249Z"
  },
  {
    "user": "Mayank",
    "letter": "dsffd",
    "stamp": "stamp5",
    "attachmentPath": null,
    "date": "2024-08-13T16:33:52.510Z"
  },
  {
    "user": "Mayank",
    "letter": "dfsa",
    "stamp": "no-stamp",
    "attachmentPath": null,
    "date": "2024-08-13T16:33:56.865Z"
  },
  {
    "user": "Mati",
    "letter": "sdfsadf",
    "stamp": "no-stamp",
    "attachmentPath": null,
    "date": "2024-08-13T16:35:23.110Z"
  }
]